



banlist_preview=f"⛔ Заблокированные люди от которых теперь вы не получаете сообщений в боте:\n\n" \
                f"Очистить всех: /banlist_clear\n\n" \
                f"Удалить человека из Бан-листа - выберите пользователя ниже"





welcome_preview=("<b>Это персональный помощник 🤖для увеличения продаж ⚡📈 и упрощения связи с клиентами. ☎</b>\n\n"\
                 "Отметьте ваши товары в разделе <b>Выбрать товары🕹</b> и начните скорее продавать!💹"
                 )


parametrs_info=\
           "<b>Сводка</b>\n\n"\
           "<b>Аудитория</b>\n"\
           "Количество пользователей всего: {0}\n"\
           "Количество активных пользователей сейчас: {1}\n"\
           "Количество людей с premium: {2}\n\n"\





support_info=   "<b><i><u>❓Как пользоваться ботом❓</u></i></b>\n\n" \
                "🔶 Вы выбираете ваше ключевое слово(ваш интересующий товар) в разделе <u><b>Выбрать товар</b></u>\n\n" \
                "Теперь по вашим словам бот начнет пересылать вам все сообщения из чатов, где оно упоминалось\n\n" \
                "🔷 В разделе  <u><b>Ключевые слова</b></u> можно посмотреть ваш список ключевых слов поиска\n\n " \
                "<b><i><u>‼Советуем‼</u></i></b>\n\n" \
                "🔶Если хотите добавить больше одного ключевого слова,"\
                "\n\nприобретите <b><i><u>Premium-тариф🔮</u></i></b> и сможете добавлять любое "\
                "количество "\
                "слов и товаров\n\n"\
                "🔷 Когда к вам приходит новое сообщение, в нем будут отмечены ваши выбранные позиции\nлибо значком - ⚡(Выбрать товары)\nлибо - 🔑(Ключслова)\n\n"\
                "🔶В каждом сообщении вы можете как связаться☎ с потенциальным покупателем по <u>ссылке</u>,\nтак и заблокировать его⛔\n\n"\
                "🔷 Все заблокированные люди будут в разделе <u><b>Блок-лист❌</b></u>\n" \
                "в нем можно разблокировать🔓 покупателей\n\n" \
                "🔶 Если вы больше не хотите получать сообщения,\nто нажмите <u><b>Продажи на паузу⏸</b></u> \nПоявилось Желание? -\n<u><b>Возобновить продажи▶</b></u>\n\n"  \
                "🔷 В разделе <u><b>Статистика запросов</b></u>отображается количество запросов за сутки по разным позициям товаров\n\n "\
                "📣📣<b><i>Контакты для обратной связи по работе бота, рекламе и сотрудничеству в шапке профиля⏫⏫</i></b> "

premium_offer=('Если вам нужно больше ключевых слов для поиска,\nто необходимо купить Premium-тариф и вы сможете '
               'добавлять до 1000 слов.\nДля покупки <b>Premium</b> нажмите "Premium-тариф🔮" ')
premium_offer_autocall=('<b>❗️Сервис Автопродажи доступен только с '
                        'Premium-тарифом🔮❗️\n\n🤖Автоответчик</b> '
                        '- это '
                        'ассистент эффективного продавца, освобождающий вас от рутинной отправки  '
                        'прайса клиентам Горбушки и возлагающий эту задачу на себя💯\nЗаинтресованные покупатели сразу '
                        'смогут с вами связаться')



premium_promo='💎 Premium-тариф💎\n\n' \
              'Преимущества Premium-тарифа позволяют:\n\n' \
              '1) <b>"Выбрать товары🕹"</b> без ограничения количества позиций (на бесплатном тарифе максимум 1 позиция)\n\n' \
              '2) Добавлять свои <b>"Ключевые слова🔎"</b>, с лимитом до 1000 ключевых слов (вместо 1 ключевого слова на бесплатном тарифе)\n\n'\
              'Кликните <u><b>Оплатить</b></u>, чтобы приобрести <b>💎Premium-тариф💎</b> всего лишь за 990₽ в месяц\n'
premium_promo1='<b>По случаю первых дней работы бота мы безвозмездно раздаем всем на время Premium-тариф\n\n ' \
               'Кликай по кнопке и забирай свой Premium</b>'
premium_purchase_ok=f'<b>Оплата прошла успешно!✅</b>\n\nПремиум-тариф будет '\
                            f'активен в течении '\
                            '30 '\
                            'дней\n\n'
premium_bonus='Отлично, Premium-тариф <b>успешно приобретен</b>✅\n' \
              '\n' \
              'Контакт для обратной связи о работе бота и всем интересующим вопросам:\n\n' \
              '@Gorbushkinreseller'

autocall_text=('<b>Мой Прайслист</b>\n\n'
             '🕒<b>Текущий</b>: Просмотреть свой текущий прайслист\n\n'
             '🔽<b>Загрузить</b> : Обновить или создать ваш прайслист\n\n'
             '🤖<b>Автоответчик</b>: Бот автоматически отвечает покупателю на его запрос по товарам согласно вашему '
             'прайслисту')

# result_msg=['предложите!', '', '', 'мир вам  $key', '15  yellow 512 $choice', '15 pro max natural 1tb $choice', '15 blue 512']
#
#
# print(result_msg)
# my_list = [1, 2, 3, 4, 5]
# print("Список до вставки:", my_list)
#
# # Вставляем элемент 10 на позицию 2
# my_list.insert(2, 10)
# print("Список после вставки:", my_list)